Revit 2024 API
ViewNode Members
The ViewNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCameraInfo
 Information about the observation point (the camera) of the view.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RenderNode.)
LevelOfDetail
 The level of detail the view is going to be rendered at.
NodeName
 A readable name of the output node.
 (Inherited from RenderNode.)
ViewId
 The Id of the view element.
See Also
ViewNode Class
Autodesk.Revit.DB Namespace